#### Concatenation, Merging, Joining the data frames are common tasks when we are dealing with data of different dataframes when multiple data tables are in relation with each other. We can create new dataframes by  these functions

In [1]:
import pandas as pd
import numpy as np

#### Concatenation

In [4]:
dic1 = {'Names':['John', 'Sam', 'Raj', 'Dev'],
       'GPA':[67, 78, 89, 90]}
Students1 = pd.DataFrame(data = dic1)
Students1

  Names  GPA
0  John   67
1   Sam   78
2   Raj   89
3   Dev   90

In [5]:
dic2 = {'Names':['Sree', 'Radha', 'Mohan', 'Latha'],
       'GPA':[78, 67, 67, 84]}
Students2 = pd.DataFrame(data = dic2)
Students2

   Names  GPA
0   Sree   78
1  Radha   67
2  Mohan   67
3  Latha   84

In [12]:
# If we have two dataframes and want to concat them to get all the student names and thier GPA into one dataframe
pd.concat([Students1, Students2])

   Names  GPA
0   John   67
1    Sam   78
2    Raj   89
3    Dev   90
0   Sree   78
1  Radha   67
2  Mohan   67
3  Latha   84

In [16]:
pd.concat([Students1, Students2], axis = 0,).reset_index(inplace = True)